src/main/resources/user-request.xml

<!-- 
Postman
POST to http://localhost:8095/soapWS
content type text/xml
https://www.youtube.com/watch?v=mr_2-AWYCoc
-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:us="http://techprimers.com/spring-boot-soap-example">
    <soapenv:Header/>
    <soapenv:Body>
    	<us:getUserRequest>
    		<us:name>Sam</us:name>	
    	</us:getUserRequest>
    </soapenv:Body>
</soapenv:Envelope>