КСиС/ksis6/ksis6/spring-boot-soap-example-master/src/main/resources/user-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:us="http://techprimers.com/spring-boot-soap-example">
    <soapenv:Header/>
    <soapenv:Body>
        <us:getUserRequest>
            <us:fileName> </us:fileName>
            <us:offset>0</us:offset>
            <us:text>Sam</us:text>
        </us:getUserRequest>
    </soapenv:Body>
</soapenv:Envelope>